Tekla.Structures.DirectManipulation.Adapter.TeklaStructuresInfo
The Tekla.Structures.DirectManipulation.Adapter.TeklaStructuresInfo class provides TS's information.

Tekla.Structures.DirectManipulation.Adapter.TeklaStructuresInfo.Retriever
The information retriever.

Tekla.Structures.DirectManipulation.Adapter.TeklaStructuresInfo.IsViewerMode
Gets a value indicating whether the current application is in Viewer mode.
Returns: A value indicating whether the current application is in Viewer mode.

Tekla.Structures.DirectManipulation.Adapter.TeklaStructuresInfo.GetDataFolder
Gets data folder.
Returns: The data folder.